app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: 20)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 104], ["LIMIT", 1]]
---
  def show
    #byebug
    @user = User.find params[:id]

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Nguyen Ngoc Duy "], ["updated_at", "2018-12-18 08:29:06.197830"], ["id", 101]]
---
  def update
    @user = User.find params[:id]
      if @user.update! user_params

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
  def destroy
    #byebug
    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
  def verify_admin?
    @user = User.find(params[:id])